facebook/app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
        <td class="ml-3"><%= post.author.first_name %></td>
        <td><%= post.comments.count %></td>