facebook/app/views/posts/show.html.erb

<small class="d-flex flex-start">
  <% if !current_user.liked_posts.ids.include?(@post.id) %>
    <span> <%= @post.likes.count %> Likes </span>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 2], ["user_id", 3], ["LIMIT", 1]]
SELECT "posts"."id" FROM "posts" INNER JOIN "likes" ON "posts"."id" = "likes"."post_id" WHERE "likes"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 3]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 3]]

    <i>
      <span> <%= @post.likes.count %> Likes </span>
      <%= link_to 'unlike', like_path(current_user.likes.ids ), method: :delete %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 3]]
SELECT "likes"."id" FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 3]]

<div>
  <h2><strong><%= @post.comments.count %></strong> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]