facebook/app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.create(comment_params)
---
INSERT INTO "comments" ("commentary", "created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commentary", "a comment"], ["created_at", "2020-01-22 09:43:38.748925"], ["updated_at", "2020-01-22 09:43:38.748925"], ["user_id", 4], ["post_id", 2]]

  def destroy
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 2], ["LIMIT", 1]]