facebook/app/controllers/likes_controller.rb

  def create
    @like = current_user.likes.build(like_params)
    if @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["post_id", 3], ["status", true], ["created_at", "2019-12-28 20:26:08.515200"], ["updated_at", "2019-12-28 20:26:08.515200"]]

  def destroy
    @like = Like.find(params[:id])
    @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]