facebook/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @like = Like.new
    @comment = Comment.new
    @post = Post.find(params[:id])

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "new post"], ["created_at", "2019-12-24 19:35:27.519529"], ["updated_at", "2019-12-24 19:35:27.519529"], ["user_id", 2]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def correct_user
    @post = Post.find(params[:id])
    @creator = User.find(@post.user_id)