facebook/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all_except(current_user)
    @user = current_user
    @not_friends = @users.filter { |user| !@user.friends.include?(user) }

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @user = User.where(id: params[:id])